{
  "projects": [
      {
          "title": "OntoSeer - A Recommendation System to Improve the Quality of Ontologies",
          "description": "Building an ontology is not only a time-consuming process, but it is also confusing, especially for beginners and the inexperienced. Although ontology developers can take the help of domain experts in building an ontology, they are not readily available in several cases for a variety of reasons. Ontology developers have to grapple with several questions related to the choice of classes, properties, and the axioms that should be included. Apart from this, there are aspects such as modularity and reusability that should be taken care of. From among the thousands of publicly available ontologies and vocabularies in repositories such as Linked Open Vocabularies (LOV) and BioPortal, it is hard to know the terms (classes and properties) that can be reused in the development of an ontology. A similar problem exists in implementing the right set of ontology design patterns (ODPs) from among the several available. Generally, ontology developers make use of their experience in handling these issues, and the inexperienced ones have a hard time. In order to bridge this gap, we propose a tool named OntoSeer, that monitors the ontology development process and provides suggestions in real-time to improve the quality of the ontology under development. It can provide suggestions on the naming conventions to follow, vocabulary to reuse, ODPs to implement, and axioms to be added to the ontology.",
          "authors": "Pramit Bhattacharyya",
          "category": "Ontology Modelling and Enrichment",
          "githubUrl": "https://github.com/kracr/ontoseer",
          "publicationUrl": "",
          "year": null
      },
      {
          "title": "ODPReco - An Ontology Design Pattern Recommendation System",
          "description": "Ontologies evolve over time due to changes in the domain and the requirements of the application. Maintaining an ontology over time and keeping it up-to-date with respect to the changes in the domain and the requirements of application is hard. But a high quality ontology can significantly reduce the effort and the cost of ontology maintenance. Ontology Design Patterns (ODPs) can be used to improve the quality of an ontology and make it more modular and reusable. But with  increasing number of ODPs spread across different categories, it is not easy to determine the right set of ODPs to choose for a particular use case even for experts. This becomes even more difficult in the case of refactoring existing ontologies using the right set of ODPs. We built a tool named ODPReco that can recommend the possible ODPs to use in a given ontology by analyzing its lexical, structural, and behavioural aspects.",
          "authors": "Maleeha Arif Yasvi",
          "category": "Ontology Modelling and Enrichment",
          "githubUrl": "https://github.com/kracr/ODPReco",
          "publicationUrl": "",
          "year": null
      },
      {
          "title": "Reinforcement Learning for Description Logic Reasoning",
          "description": "Motivated by the need for reasoning approaches that can scale well even on the most expressive, and large ontologies, neuro-symbolic approaches have received major attention in recent times. The idea is to combine the robustness and learning capabilities of the artificial neural networks along with the precise reasoning abilities of logic-based approaches. We are exploring a reinforcement learning solution that can take advantage of the exploration-exploitation trade-off to reduce the overall time complexity of the reasoning algorithms.",
          "authors": "Gunjan Singh, Sumit Bhatia",
          "category": "Description Logic Reasoning",
          "githubUrl": "",
          "publicationUrl": "",
          "year": null
      },
      {
          "title": "SAQI: An Ontology based Knowledge GraphPlatform for Social Air Quality Index",
          "description": " The Social Air Quality Index(SAQI) ontology is used to integrate the data from local and centralmonitoring sensors, meteorological data, and data from field surveys.This data is converted into a Knowledge Graph, which in turn is used tobuild an application for civic engagement with the public on pollution inorder to improve community participation of the local institutions andindividuals.",
          "authors": "Saad Ahmad, Sudhir Attri, Ruchi Dwivedi, Muzamil Yaqoob, AasimKhan, Praveen Priyadarshi, and Raghava Mutharaju",
          "category": "Ontology Modelling and Enrichment",
          "githubUrl": "https://github.com/kracr/aq-structured-platform",
          "publicationUrl": "",
          "year": {
              "$date": "2022-01-01T00:00:00Z"
          }
      }
  ]
}